# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'diff-so-fancy'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'findutils' # GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub' # additional git features
brew 'jq' # Used for spatie/visit
brew 'lazygit'
brew 'mackup' # backup all application settings
brew 'mas' # use app store from the cli
brew 'ncdu'
brew 'neofetch'
brew 'neovim'
brew 'prettyping'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'trash' # move items to the trash
brew 'tree' # tree command from windows
brew 'wget'
brew 'wifi-password'
brew 'zoxide'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'meilisearch'

# Apps
cask 'aerial'
cask 'amie'
cask 'android-platform-tools'
cask 'arc'
cask 'dbngin'
cask 'discord'
cask 'figma'
cask 'firefox-developer-edition'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'keka'
cask 'mediamate'
cask 'nordvpn'
cask 'obsidian'
cask 'orbstack'
cask 'raycast'
cask 'setapp'
cask 'slack'
cask 'spotify'
cask 'sublime-merge'
cask 'telegram-desktop'
cask 'ticktick'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp'
cask 'zwift'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-fira-code'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
