# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'

# Install Antigen
brew 'antigen'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'android-platform-tools'
brew 'bat'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git-flow-avh'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'hub' # additional git features
brew 'mackup' # backup all application settings
brew 'mas' # use app store from the cli
brew 'ncdu'
brew 'nvm'
brew 'prettyping'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'trash' # move items to the trash
brew 'tree' # tree command from windows
brew 'unrar'
brew 'wget'
brew 'wifi-password'
brew 'yarn'

# Development
brew 'php'
brew 'mysql@5.7'
brew 'imagemagick'
brew 'redis'

# Apps
cask 'aerial' # screen saver
cask 'alfred'
cask 'caffeine' # toggle sleep timer
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'postman'
cask 'iterm2'
cask 'sublime-merge'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook - hitting space in finder
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'LastPass', id: 926036361
mas 'Harvest', id: 506189836
mas 'Slack', id: 803453959
mas 'GIPHY CAPTURE', id: 668208984
mas 'Spark', id: 1176895641
mas 'Magnet', id: 441258766
mas 'Bear', id: 1091189122
